In [1]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine

![png](client_file.png)

Part 2

In [2]:
#create a connection
connection = "mysql+pymysql://root:root@127.0.0.1:3306/books"
engine = create_engine(connection)

Run the "SHOW TABLES;" query

In [6]:
q = "SHOW TABLES;"
pd.read_sql(q, engine)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

In [7]:
q = """SELECT books.title, favorites.user_id
FROM books
JOIN favorites ON books.id = favorites.book_id
WHERE favorites.user_id = 
    (SELECT users.id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John")); """
pd.read_sql(q, engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1